import BaseSeeder from "@ioc:Adonis/Lucid/Seeder";
import SubPlo from "App/Models/SubPlo";

export default class extends BaseSeeder {
  public async run() {
    // Write your database queries inside the run method

    const subPLOsData = [
      {
        plo_id: 1,
        sub_plo_title: "1A",
        sub_plo_description:
          "สามารถวิเคราะห์ผลกระทบจากการใช้ซอฟต์แวร์ต่อบุคคลองค์กรและสังคม",
      },
      {
        plo_id: 1,
        sub_plo_title: "1B",
        sub_plo_description:
          "มีจรรยาบรรณทางวิชาการและวิชาชีพด้านวิศวกรรมซอฟต์แวร์",
      },
      {
        plo_id: 1,
        sub_plo_title: "1C",
        sub_plo_description:
          "สามารถวิเคราะห์ปัญหา เข้าใจและอธิบายความต้องการทางวิศวกรรมซอฟต์แวร์ รวมทั้งประยุกต์ความรู้ทักษะ และการใช้เครื่องมือที่เหมาะสมกับการแก้ไขปัญหา",
      },
      {
        plo_id: 1,
        sub_plo_title: "1D",
        sub_plo_description:
          "ตระหนักในคุณค่าและคุณธรรม จริยธรรม เสียสละ และซื่อสัตย์สุจริต",
      },
      {
        plo_id: 1,
        sub_plo_title: "1E",
        sub_plo_description:
          "มีวินัย ตรงต่อเวลา และความรับผิดชอบต่อตนเอง วิชาชีพด้านวิศวกรรมซอฟต์แวร์และสังคม",
      },
      {
        plo_id: 1,
        sub_plo_title: "1F",
        sub_plo_description:
          "มีความรู้และความเข้าใจเกี่ยวกับหลักการและทฤษฎีที่สำคัญในเนื้อหาสาขาวิศวกรรมซอฟต์แวร์",
      },
      {
        plo_id: 2,
        sub_plo_title: "2A",
        sub_plo_description:
          "สามารถสืบค้น ตีความ และประเมินสารสนเทศ เพื่อใช้ในการแก้ไขปัญหาอย่างสร้างสรรค์",
      },
      {
        plo_id: 2,
        sub_plo_title: "2B",
        sub_plo_description:
          "สามารถแนะนำประเด็นการแก้ไขปัญหาโดยใช้สารสนเทศทางคณิตศาสตร์หรือการแสดงสถิติประยุกต์ต่อปัญหาที่เกี่ยวข้องอย่างสร้างสรรค์",
      },
      {
        plo_id: 2,
        sub_plo_title: "2C",
        sub_plo_description:
          "สามารถรวมรวม วิเคราะห์ ออกแบบ ติดตั้ง ปรับปรุงและ/หรือประเมินระบบองค์ประกอบต่าง ๆ ของระบบซอฟต์แวร์ให้ตรงตามข้อกำหนด",
      },
      {
        plo_id: 3,
        sub_plo_title: "3A",
        sub_plo_description:
          "สามารถติดตามความก้าวหน้าทางวิชาการ และวิวัฒนาการซอฟต์แวร์ รวมทั้งการนำไปประยุกต์",
      },
      {
        plo_id: 3,
        sub_plo_title: "3B",
        sub_plo_description:
          "มีความรู้ในแนวกว้างของสาขาวิศวกรรมทางซอฟต์แวร์ และเข้าใจผลกระทบของเทคโนโลยีใหม่ๆ ที่เกี่ยวข้อง",
      },
      {
        plo_id: 3,
        sub_plo_title: "3C",
        sub_plo_description:
          "สามารถประยุกต์ความรู้ และทักษะกับการแก้ไขปัญหาทางซอฟต์แวร์ได้อย่างเหมาะสม",
      },
      {
        plo_id: 3,
        sub_plo_title: "3D",
        sub_plo_description:
          "มีทักษะในการบริหารจัดการในด้านเวลา เครื่องมือ อุปกรณ์ และวิธีการ ที่เป็นปัจจุบันสำหรับการทำงานที่เกี่ยวกับระบบซอฟต์แวร์",
      },
      {
        plo_id: 3,
        sub_plo_title: "3E",
        sub_plo_description:
          "มีประสบการณ์ในการพัฒนาและ/หรือการประยุกต์ซอฟต์แวร์ที่ใช้งานได้จริง",
      },
      {
        plo_id: 3,
        sub_plo_title: "3F",
        sub_plo_description:
          "สามารถบูรณาการความรู้ในสาขาวิศวกรรมซอฟต์แวร์กับความรู้ในศาสตร์อื่น ๆ ที่เกี่ยวข้อง",
      },
      {
        plo_id: 4,
        sub_plo_title: "4A",
        sub_plo_description:
          "สามารถวางแผน และจัดการโครงการซอฟต์แวร์อย่างมีประสิทธิภาพ",
      },
      {
        plo_id: 4,
        sub_plo_title: "4B",
        sub_plo_description:
          "เข้าใจหลักการวิเคราะห์ธุรกิจ เพื่อเข้าใจตลาด และผู้ใช้งาน",
      },
      {
        plo_id: 4,
        sub_plo_title: "4C",
        sub_plo_description:
          "เข้าใจการบริหารจัดการธุรกิจ เพื่อให้มีการดำเนินธุรกิจอย่างมีประสิทธิภาพ",
      },
      {
        plo_id: 4,
        sub_plo_title: "4D",
        sub_plo_description:
          "เรียนรู้ และพัฒนาทักษะ เพื่อเข้ากับการเป็นผู้ประกอบการซอฟต์แวร์ในยุคดิจิทัลที่เปลี่ยนแปลงอย่างรวดเร็ว",
      },
      {
        plo_id: 5,
        sub_plo_title: "5A",
        sub_plo_description:
          "เคารพสิทธิและรับฟังความคิดเห็นของผู้อื่น รวมทั้งเคารพในคุณค่าและศักดิ์ศรีของความเป็นมนุษย์",
      },
      {
        plo_id: 5,
        sub_plo_title: "5B",
        sub_plo_description:
          "สามารถสื่อสารทั้งภาษาไทยและภาษาต่างประเทศกับกลุ่มคนหลากหลายอย่างมีประสิทธิภาพ",
      },
      {
        plo_id: 5,
        sub_plo_title: "5C",
        sub_plo_description:
          "มีภาวะความเป็นผู้นำและผู้ตาม ในการปฏิบัติงานเป็นทีม และสามารถช่วยแก้ไขปัญหาภายในทีมได้อย่างเหมาะสม",
      },
      {
        plo_id: 5,
        sub_plo_title: "5D",
        sub_plo_description:
          "มีความรับผิดชอบในการกระทำของตนเอง และรับผิดชอบงานที่ได้รับมอบหมาย ในการปฏิบัติงานเป็นทีม",
      },
      {
        plo_id: 5,
        sub_plo_title: "5E",
        sub_plo_description:
          "สามารถเลือกใช้สื่อสารสนเทศ ในการค้นคว้า พัฒนาตนเองให้สอดคล้องกับสถานการณ์ในขณะนั้นได้อย่างเหมาะสม",
      },
      {
        plo_id: 5,
        sub_plo_title: "5F",
        sub_plo_description:
          "เคารพกฎระเบียบและข้อบังคับต่าง ๆ ขององค์กรและสังคม",
      },
      {
        plo_id: 5,
        sub_plo_title: "5G",
        sub_plo_description:
          "สามารถเป็นผู้ริเริ่มแสดงประเด็นในการแก้ไขสถานการณ์ทั้งส่วนตัวและส่วนรวม พร้อมทั้งแสดงจุดยืนอย่างพอเหมาะทั้งของตนเองและของกลุ่ม",
      },
    ];

    await SubPlo.createMany(subPLOsData);
  }
}
